*> ******************************************************************
*> * Purpose: Hello World program in COBOL
*> ******************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.

ENVIRONMENT DIVISION.
PROCEDURE DIVISION.
    DISPLAY 'Hello World!'.
    STOP RUN.
END PROGRAM HelloWorld.
