IDENTIFICATION DIVISION.
PROGRAM-ID. Circles.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER.
OBJECT-COMPUTER.

INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01  WS-CONSTANTS.
   05  WS-PI               PIC 9V99999 VALUE 3.14159.
01   WS-CIRCLE.
   05 WS-AREA              PIC 999V99 VALUE ZEROES.
   05 WS-RADIUS            PIC 9999V99 VALUE ZEROES.
   05 WS-CIRCUMFENCE       PIC 99999V99 VALUE ZEROES.
01   WS-DISPLAY-VALUES.
   05 WS-DISPLAY-AREA      PIC ZZ99.99.
   05 WS-DISPLAY-CIRCUMFENCE  PIC ZZ99.99.

PROCEDURE DIVISION.

0100-PROCESS-RECORDS.

   DISPLAY "Please enter radius of circle: ".
   ACCEPT WS-RADIUS.
   COMPUTE WS-CIRCUMFENCE = 2 * WS-PI * WS-RADIUS.
   MOVE WS-CIRCUMFENCE TO WS-DISPLAY-CIRCUMFENCE.
   DISPLAY "Circle Circumfrence is: ", WS-DISPLAY-CIRCUMFENCE.
   COMPUTE WS-RADIUS = WS-PI * WS-RADIUS * WS-RADIUS.
   MOVE WS-AREA TO WS-DISPLAY-AREA.
   DISPLAY "Circle area is:  ", WS-DISPLAY-AREA

   STOP RUN.
