00001  *> ******************************************************************
00002  *> * Purpose: Hello World program in COBOL
00003  *> ******************************************************************
00004  
00005  IDENTIFICATION DIVISION.
00006  PROGRAM-ID. HelloWorld.
00007  
00008  ENVIRONMENT DIVISION.
00009  PROCEDURE DIVISION.
00010      DISPLAY 'Hello World!'.
00011      STOP RUN.
00012  END PROGRAM HelloWorld.
